/* 
Опис завдання👇



Веб-додаток повинен дозволяти користувачам додавати, переглядати, видаляти та оновлювати дані про студентів, використовуючи формат даних JSON.
Кожен запис про студента повинен містити наступну інформацію: ім'я, прізвище, вік, курс, факультет та список курсів, які студент відвідує.
Спочатку веб-додаток повинен дозволяти користувачам додавати нові записи про студентів, заповнюючи форму з відповідними полями. Після відправки форми, дані повинні бути перетворені у формат JSON та збережені у файлі.
Після збереження даних користувач повинен мати можливість переглянути всі записи про студентів. Для цього веб-додаток повинен зчитувати дані з файлу, розбирати їх у форматі JSON та відображати у вигляді таблиці.
Крім того, користувач повинен мати можливість видаляти та оновлювати існуючі записи про студентів. При видаленні запису, дані повинні бути видалені з файлу. При оновленні запису, дані повинні бути змінені у файлі.


Для перетворення даних у формат JSON та зворотнього перетворення з формату JSON у звичайний об'єкт використовуються методи JSON.parse() та JSON.stringify() відповідно. При додаванні, оновленні та видаленні записів, користувач повинен бути попереджений у разі введення некоректних даних, які не відповідають формату JSON.



Таким чином, веб-додаток дозволить користувачам легко зберігати та організовувати дані про студентів у форматі JSON, що є популярним у веб-розробці.

 */


const name = document.getElementById("name");
const serName = document.getElementById("serName");

const age = document.getElementById("age");

const course = document.getElementById("course");

const faculty = document.getElementById("faculty");

const courses = document.getElementById("courses");

const submitBtn = document.getElementById("submitBtn");

submitBtn.addEventListener("click", ()=> {
    const student = {
        name: name.value,
        serName: serName.value,
        age: Number(age.value),
        course: course.value,
        faculty: faculty.value,
        courses: courses.value.split(',').map(course => course.trim())
    }
    const studentJSON = JSON.stringify(student)
})